"""
Два правила магических методов:
1. Все магические методы срабатывают при выполнении соответствующей операции, или вызове функции
2. Все магические методы работают с уже встроенными типами данных.
   Даже в твоём классе они будут работать только built-in типами данных


__str__ и __repr__ - отвечают за текстовое отображение объекта в системе

__repr__ - как объект отображается в системе (интерпретаторе?)

__str__ - как будет отображён, если передать в функцию str() или print()

результат будет выводиться ключевым словом return
"""


